<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"828012b39bb77d5d22e38f961e42ae9afbcdc52d0b60f5e57e226f14c71a70d3","plan_job_ref":"Job Frontpage #19 at https://github.com/coverage-robot/frontpage/actions/runs/5870971742","plan_hash":"92668ba2e3bbf0c1ff74df8d4ebc64821444b9507f623dd85278176b3466276a","plan_text_format":"text","version":"1.36.1"} -->
Terraform plan in __./infrastructure__ in the __prod__ workspace
<details>
<summary>Plan: 2 to add, 1 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_s3_object.static_files["assets/action-bd0090a6.png"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = "coverage-frontpage-prod"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/png"
      + etag                   = "121c5030a87f9be340994a1bc053b8c0"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/action-bd0090a6.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/assets/action-bd0090a6.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/action-c7e27fcf.png"] will be destroyed
  # (because key ["assets/action-c7e27fcf.png"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "coverage-frontpage-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "image/png" -> null
      - etag                   = "de949d5aefad725e3b792949f374555e" -> null
      - force_destroy          = false -> null
      - id                     = "assets/action-c7e27fcf.png" -> null
      - key                    = "assets/action-c7e27fcf.png" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/assets/action-c7e27fcf.png" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.static_files["assets/index-5d06ebb7.js"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = "coverage-frontpage-prod"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "ca58000f3a82d5b453d0045a23b7cecb"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/index-5d06ebb7.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/assets/index-5d06ebb7.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/index-bcafb055.js"] will be destroyed
  # (because key ["assets/index-bcafb055.js"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "coverage-frontpage-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "2a852fe83f795fd7ea0719220e33dd60" -> null
      - force_destroy          = false -> null
      - id                     = "assets/index-bcafb055.js" -> null
      - key                    = "assets/index-bcafb055.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/assets/index-bcafb055.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.static_files["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ etag                   = "9e3f0680abc0a11880cafaa87b337f35" -> "ada835826dce0b7d18e2bcdfa773ce7f"
        id                     = "index.html"
        tags                   = {}
      + version_id             = (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Frontpage #19](https://github.com/coverage-robot/frontpage/actions/runs/5870971742)